Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКиЗГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_ИдЦентр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВзаимозачета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коробки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНоменклатурыПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказПоставщику/Forms/ххх_ФормаСписка/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораТТН(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		ПоступлениеТоваровПриСоздании = СоздатьНайтиПоступлениеНаСервере(РезультатОткрытияФормы, Ложь, ДополнительныеПараметры.ЗаказПоставщику);
		ПодключитьОбработчикОжидания("ОткрытьФормуПоступленияТоваровПриСоздании", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоступленияТоваровПриСоздании()
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПоступлениеТоваровПриСоздании);
	
	ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы "Внешние обработки".
	//ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

	// СтандартныеПодсистемы.Печать
		//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	ДатаОбновленияСостоянияОплатыИПоступления = Константы.ДатаОбновленияСостоянияОплатыИПоступления.Получить();
	Если НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(ДатаОбновленияСостоянияОплатыИПоступления) Тогда
		Элементы.ГруппаПодвал.Видимость = Истина;
	Иначе
		Элементы.ГруппаПодвал.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияРТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьСклада();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Организация = Настройки.Получить("Организация");
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Магазин       = Настройки.Получить("Магазин");
	Склад         = Настройки.Получить("Склад");
	Контрагент    = Настройки.Получить("Контрагент");
	УстановитьОтборДинамическогоСписка("Магазин");
	УстановитьОтборДинамическогоСписка("Склад");
	УстановитьОтборДинамическогоСписка("Контрагент");
	УстановитьОтборДинамическогоСписка("Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Склад");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМагазинПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Магазин");
	УстановитьОтборДинамическогоСписка("Склад");
	
	УстановитьДоступностьСклада();

КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Контрагент");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваровНаОснованииТТН(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ЗаказПоставщику = ТекущиеДанные.Ссылка;
		
		ПараметрыФормы = Новый Структура;
		ТекстСообщения = "";
		Если НЕ ВозможностьВводаПоступленияНаОснованииТТН(ЗаказПоставщику, ПараметрыФормы, ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Список,
				,
				);
			Возврат
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЗаказПоставщику", ЗаказПоставщику);
		
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыбораТТН", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Документ.ТТНВходящаяЕГАИС.Форма.ФормаВыбораРТ", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,, ОбработчикОповещения, Режим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеОплатыИПоступления(Команда)
	
	ОбновитьСостояниеОплатыИПоступленияСервер();
	
	ПоказатьОповещениеПользователя(
			,
			,
			НСтр("ru='Статусы просрочки поступления и оплаты успешно обновлены'"),
			БиблиотекаКартинок.Информация32);
	Элементы.ГруппаПодвал.Видимость = Ложь;
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает отбор динамических списка формы.
//
&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ИмяРеквизита)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСклада()

	Элементы.ОтборСклад.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Магазин);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеОплатыИПоступленияСервер()
	ЗакупкиСервер.ОбновлениеСостоянияОплатыИПоступления();
КонецПроцедуры

&НаСервере
Функция ВозможностьВводаПоступленияНаОснованииТТН(ЗаказПоставщику, ПараметрыФормы, ТекстСообщения)
	
	Возврат ИнтеграцияЕГАИСРТ.ВозможностьВводаПоступленияНаОснованииТТН(ЗаказПоставщику, ПараметрыФормы, ТекстСообщения);
	
КонецФункции // ВозможностьВвоодаТТН()

&НаСервере
Функция СоздатьНайтиПоступлениеНаСервере(ТТН, ТолькоПоиск, ЗаказПоставщику)
	
	ПоступлениеТоваров = ИнтеграцияЕГАИСРТ.СоздатьНайтиПоступление(ТТН, ТолькоПоиск, ЗаказПоставщику);
	
	Возврат ПоступлениеТоваров;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьЗаказПоставщикуКнопка(Команда)
	ПараметрыВыполненияКоманды=Новый структура;
	ПараметрыВыполненияКоманды.Вставить("Источник",ЭтаФорма);
	ОбработкаКоманды("", ПараметрыВыполненияКоманды);
КонецПроцедуры

#КонецОбласти






//Zorius
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ххх_ФормаДокумента" тогда
		МассивСтрок=Новый массив;
		МассивСтрок.Добавить(ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
		ПроверкаВыбранныхДокументов(МассивСтрок);
		ВыгрузитьЗаказПоставщику(МассивСтрок);	
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.ИмяФормы="Документ.ЗаказПоставщику.Форма.ххх_ФормаСписка" тогда
		Если ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки.количество()<>0 Тогда
			йцу=ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки;
			ПроверкаВыбранныхДокументов(йцу);
			МассивСтрок=Новый массив;
			Для каждого ссыль из ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки Цикл
				МассивСтрок.Добавить(ссыль);
			КонецЦикла;
			ВыгрузитьЗаказПоставщику(МассивСтрок);
		Иначе
			Сообщить("Для выгрузки заявок необходимо выделить строку/строки.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаВыбранныхДокументов(МассивСтрок)
	й=0;
	Пока й<МассивСтрок.количество() Цикл
		Если Формат(МассивСтрок[й].Дата,"ДФ=dd.MM.yyyy")<>Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") и не рольДоступна("ПолныеПрава") Тогда
			вызватьИсключение("Нельзя выгружать заказы за предыдущие дни");
		КонецЕсли;
		
		Если не МассивСтрок[й].проведен тогда
			вызватьИсключение("Документ: "+Строка(МассивСтрок[й])+". Нельзя выгружать не проведённый документ!");	
		КонецЕсли;
		//Заказ=Документы.ЗаказПоставщику.СоздатьДокумент();
		Путь=МассивСтрок[й].контрагент.ДополнительныеРеквизиты.Найти(Справочники.ххх_Справочник.ПутьВыгрузкиЗаявок.Значение,"Свойство");
		Если не значениеЗаполнено(Путь)или не значениеЗаполнено(Путь.Значение) тогда
			вызватьИсключение("Не заполнен путь выгрузки файла для контрагента: "
				+Строка(МассивСтрок[й].Контрагент));
		КонецЕсли;
		ЗначениеДопСведенияИдНоменклатурыВБазеПоставщика=
			МассивСтрок[й].контрагент.ДополнительныеРеквизиты.Найти(
			Справочники.ххх_Справочник.ПутьВыгрузкиЗаявок.Значение,"Свойство");
		Если не значениеЗаполнено(ЗначениеДопСведенияИдНоменклатурыВБазеПоставщика)
			или не значениеЗаполнено(ЗначениеДопСведенияИдНоменклатурыВБазеПоставщика.Значение) тогда
				вызватьИсключение("Не заполнено значение допполнительного сведения: "
				+Справочники.ххх_Справочник.СвязкаКонтрагентаСИдТовараВЕгоБазе.Значение.Наименование
				+" Контрагент:"+Строка(МассивСтрок[й].Контрагент));
		КонецЕсли;
		й=й+1;
	КонецЦикла;
КонецПроцедуры

Процедура ВыгрузитьЗаказПоставщику(Заказы)	
	
	Для каждого Заказ из заказы Цикл
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ссыль",Заказ.ссылка);
		Запрос.УстановитьПараметр("ИдТов1",Справочники.ххх_Справочник.id_b1.Значение);
		Запрос.УстановитьПараметр("ИдТов2",Справочники.ххх_Справочник.id_b2.Значение);
		Запрос.УстановитьПараметр("ИдТов3",Справочники.ххх_Справочник.id_b3.Значение);
		Запрос.УстановитьПараметр("ДопСвойствоПутьДляВыгрузкиЗаявок",Справочники.ххх_Справочник.ПутьВыгрузкиЗаявок.Значение);
		Запрос.УстановитьПараметр("УказательНаУказательИдТовараПоставщика",Справочники.ххх_Справочник.СвязкаКонтрагентаСИдТовараВЕгоБазе.Значение);
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		    |	ЗаказПоставщикуТовары.Количество КАК Количество,
		    |	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
		    |	ЗаказПоставщикуТовары.Коробки КАК Коробки,
		    |	ЗаказПоставщикуТовары.Упаковки КАК Упаковки
		    |ПОМЕСТИТЬ номка
		    |ИЗ
		    |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		    |ГДЕ
		    |	ЗаказПоставщикуТовары.Ссылка = &ссыль
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	номка.Номенклатура КАК Номенклатура,
		    |	номка.Количество КАК Количество,
		    |	КонтрагентыДополнительныеРеквизиты.Значение КАК ЗначениеУказателяНаУказатель,
		    |	номка.Контрагент КАК Контрагент,
		    |	NULL КАК УказательНаУказатель,
		    |	номка.Коробки КАК Коробки,
		    |	номка.Упаковки КАК Упаковки
		    |ПОМЕСТИТЬ УазатаелиНаИдТоваровПоставщиков
		    |ИЗ
		    |	номка КАК номка
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		    |		ПО номка.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		    |			И (КонтрагентыДополнительныеРеквизиты.Свойство = &УказательНаУказательИдТовараПоставщика)
		    |			И (КонтрагентыДополнительныеРеквизиты.Значение = &ИдТов1)
		    |
		    |ОБЪЕДИНИТЬ ВСЕ
		    |
		    |ВЫБРАТЬ
		    |	номка.Номенклатура,
		    |	номка.Количество,
		    |	КонтрагентыДополнительныеРеквизиты.Значение,
		    |	номка.Контрагент,
		    |	КонтрагентыДополнительныеРеквизиты.Свойство,
		    |	номка.Коробки,
		    |	номка.Упаковки
		    |ИЗ
		    |	номка КАК номка
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		    |		ПО номка.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		    |			И (КонтрагентыДополнительныеРеквизиты.Свойство = &УказательНаУказательИдТовараПоставщика)
		    |			И (КонтрагентыДополнительныеРеквизиты.Значение = &ИдТов2)
		    |
		    |ОБЪЕДИНИТЬ ВСЕ
		    |
		    |ВЫБРАТЬ
		    |	номка.Номенклатура,
		    |	номка.Количество,
		    |	КонтрагентыДополнительныеРеквизиты.Значение,
		    |	номка.Контрагент,
		    |	КонтрагентыДополнительныеРеквизиты.Свойство,
		    |	номка.Коробки,
		    |	номка.Упаковки
		    |ИЗ
		    |	номка КАК номка
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		    |		ПО номка.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		    |			И (КонтрагентыДополнительныеРеквизиты.Свойство = &УказательНаУказательИдТовараПоставщика)
		    |			И (КонтрагентыДополнительныеРеквизиты.Значение = &ИдТов3)
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	УказателиНаИдТоваровПоставщиков.Номенклатура КАК Номенклатура,
		    |	УказателиНаИдТоваровПоставщиков.Количество КАК Количество,
		    |	УказателиНаИдТоваровПоставщиков.ЗначениеУказателяНаУказатель КАК ЗначениеУказателяНаУказатель,
		    |	УказателиНаИдТоваровПоставщиков.Контрагент КАК Контрагент,
		    |	ДополнительныеСведения.Значение КАК КодТовараПоставщика,
		    |	УказателиНаИдТоваровПоставщиков.Коробки КАК Коробки,
		    |	УказателиНаИдТоваровПоставщиков.Упаковки КАК Упаковки
		    |ПОМЕСТИТЬ КодыТоваровПоставщиков
		    |ИЗ
		    |	УазатаелиНаИдТоваровПоставщиков КАК УказателиНаИдТоваровПоставщиков
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		    |		ПО УказателиНаИдТоваровПоставщиков.ЗначениеУказателяНаУказатель = ДополнительныеСведения.Свойство
		    |			И УказателиНаИдТоваровПоставщиков.Номенклатура = ДополнительныеСведения.Объект
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	КодыТоваровПоставщиков.Количество КАК Количество,
		    |	КодыТоваровПоставщиков.Номенклатура.Наименование КАК НоменклатураНаименование,
		    |	КонтрагентыДополнительныеРеквизиты.Значение КАК ПутьДляВыгрузки,
		    |	КодыТоваровПоставщиков.Номенклатура.ххх_ИдЦентр КАК КодВЦентре,
		    |	КодыТоваровПоставщиков.КодТовараПоставщика КАК КодТовараПоставщика,
		    |	КодыТоваровПоставщиков.ЗначениеУказателяНаУказатель КАК ЗначениеУказателяНаУказатель,
		    |	КодыТоваровПоставщиков.Коробки КАК Коробки,
		    |	КодыТоваровПоставщиков.Упаковки КАК Упаковки
		    |ИЗ
		    |	КодыТоваровПоставщиков КАК КодыТоваровПоставщиков
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		    |		ПО КодыТоваровПоставщиков.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		    |			И (КонтрагентыДополнительныеРеквизиты.Свойство = &ДопСвойствоПутьДляВыгрузкиЗаявок)
		    |ИТОГИ ПО
		    |	ПутьДляВыгрузки,
		    |	ЗначениеУказателяНаУказатель";
		//Результат = Запрос.Выполнить();
		//ТаблицаЗначений = Результат.Выгрузить();
		УказателиНаУказатели=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока УказателиНаУказатели.Следующий() Цикл
			ПутиДляВыгрузки=УказателиНаУказатели.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ПутиДляВыгрузки.Следующий() Цикл	
				разделитель = "|";
				й=0;
				мас=Новый массив;
				мас.Добавить(10);
				мас.Добавить(10);
				мас.Добавить(10);
				мас.Добавить(10);                  
				мас.Добавить(10);
				мас.Добавить(70);
				колонкиТЗ=Новый Массив;
				колонкиТЗ.Добавить("id");
				Если ПутиДляВыгрузки.ЗначениеУказателяНаУказатель=Справочники.ххх_Справочник.id_b1.Значение тогда
					колонкиТЗ.Добавить("id_b1");
				ИначеЕсли ПутиДляВыгрузки.ЗначениеУказателяНаУказатель=Справочники.ххх_Справочник.id_b2.Значение тогда
					колонкиТЗ.Добавить("id_b2");
				ИначеЕсли ПутиДляВыгрузки.ЗначениеУказателяНаУказатель=Справочники.ххх_Справочник.id_b3.Значение тогда
					колонкиТЗ.Добавить("id_b3");
				КонецЕсли;
				колонкиТЗ.Добавить("kor");
				колонкиТЗ.Добавить("up");
				колонкиТЗ.Добавить("sh");
				колонкиТЗ.Добавить("naim");
				Для каждого колонка Из колонкиТЗ Цикл
				        стрКолонки =""+ стрКолонки + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(колонка,мас[й]," ","Справа") + разделитель;
					й=й+1;
				КонецЦикла; 
				//
				//Запрос=Новый запрос;
				//Запрос.Текст="ВЫБРАТЬ
				//             |	КассыККМ.ПутьКПапкеВыгрузки
				//             |ИЗ
				//             |	Справочник.КассыККМ КАК КассыККМ
				//             |ГДЕ
				//             |	КассыККМ.ПометкаУдаления = ЛОЖЬ";
				//Кассы=Запрос.Выполнить().Выбрать();
				//В иделае писать 1 файл в ТЕМП и копипастить его в внужные папки, но возможно ебалайка с правами доступа(ХЗ, как то такая хуерга помнится)
				//Пока Кассы.Следующий() Цикл
				
				Номка=ПутиДляВыгрузки.Выбрать();
				Если Номка.Количество()>0 тогда
				    кодировка = КодировкаТекста.ANSI;
				    ТекстовыйФайлЗапись = Новый ЗаписьТекста(ПутиДляВыгрузки.ПутьДляВыгрузки,Кодировка);             
					
					текст="";
					//текст=стрКолонки+Символы.ВК;
					ТекстовыйФайлЗапись.ЗаписатьСтроку(стрКолонки);
					ТекстовыйФайлЗапись.ЗаписатьСтроку("****************************************");
				    Пока Номка.Следующий() Цикл                    
				        текст = //текст
						 СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.КодВЦентре,10," ","Справа")+разделитель
						+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.КодТовараПоставщика,10," ","Справа")+разделитель
						+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.коробки,10," ","Справа")+разделитель
						+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.упаковки,10," ","Справа")+разделитель
						+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.Количество,10," ","Справа")+разделитель
						+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номка.НоменклатураНаименование,70," ","Справа")+разделитель;
						ТекстовыйФайлЗапись.ЗаписатьСтроку(текст);//+Символы.ВК;
					КонецЦикла;	
					//ТекстовыйФайлЗапись.ЗаписатьСтроку(текст);
					ТекстовыйФайлЗапись.Закрыть();
				КонецЕсли;
				//КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры



//Zorius
